# Запустить программу Ctrl + F5

print(5, 8, 6)

n = 5
b = None
c = 1.89

# Печать типа переменной
print(type(c))

# String тип имеет переменная с 'text' и "text" равнозначно
n1 = 'dadad'
n2 = "ghjgh"

# Выделить элементы -> Ctrl K -> Ctrk C   (Комментирование нескольких элементов сразу)
# print(type(n1))
# print(type(n2))

# Разкоментировать сразу несколько элементов -> Ctrl K -> Ctrl U
# print(type(n1))
# print(type(n2))

# Можно в ковычках ставить '\' и после нее ' и будет учитываться из этих символов только '
n3 = 'fd\'df'
print(n3)

# Можно использовать внутри ковычек еще другие ковычки
n4 = 'fd"adadad"df'
print(n4)

# Обычное комментирование значек решетки
# print(5)
# print(5)
# print(5)
print(5, 8)
# print(5)
print(5, 9)

# Комментировние это три " вначале данных и вконце данных
"""""
print(5)
print(5)
print(5)
print(5)
print(5)
"""""