# 3. Пользователь вводит два целых числа. Выведите меньшее из них.

first_number = int(input("Enter first number: "))
second_number = int(input("Enter second number: "))

if first_number<second_number:
    print(first_number)
else:
    print(second_number)