{"Овен":"В этом году у вас будут большие амбиции. Покажите силу своего характера. Теперь вы самостоятельно будете строить свою жизнь. Никто вам не помешает."
,"Телец":"Год будет достаточно сложным и даже неоднозначным. У вас есть шанс переехать в другой город или приобрести жилье. Это отнимет немало сил. Возможно, вам придется делать ремонт, но результаты будут потрясающими."
,"Близнецы":"Этот год будет достаточно простым и даже легким. В личной жизни вас ждет абсолютный успех. В отношениях с любимым человеком вы ощутите легкость."
,"Рак":"Вас словно тянет назад в прошлое. Вы хотите заглянуть туда и почерпнуть приятные воспоминания. Но вы должны взять себя в руки. Переступите через свои переживания и начинайте жить снова."
,"Лев":"Удача сопутствует вам. В течение всего периода вы будете уверенно продвигаться по карьерной лестнице и даже сможете оказаться на ее вершине. Отстаивайте свое право на успех"
,"Дева":"Вы будете долго и упорно работать. Финансовая ситуация будет как минимум стабильной. Если вы одиноки, в вашем окружении появится человек, который станет вашей судьбой."
,"Весы":"Вы захотите погнаться за своей мечтой. Держите ее и не отпускайте. Это ваше счастье."
,"Скорпион":"2023 год станет для вас периодом настоящего богатства. Вас ждет успех во всех финансовых делах. Но вы должны правильно вложить свой капитал, тогда в течение долгого времени вы будете счастливы."
,"Стрелец":"В этом году вам предстоят всевозможные поездки. Вы не сможете усидеть на месте. Но это вам очень понравится."
,"Козерог":"Год складывается вполне удачно. Состояние вашего здоровья постепенно улучшается. Семейная жизнь налаживается. Отношения с трудовом коллективе становятся более доверительными."
,"Водолей":"Вам предстоит вести борьбу с вредными привычками. Постарайтесь начать жизнь с чистого листа. Вы точно сможете с этим справиться."
,"Рыбы":"В этом году вас ждет удача в личной жизни. Семейные узы будут только укрепляться. Возможно, вы заключите брак или будете планировать пополнение."}